Ran Plan for dir: `appCD` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.api-gateway_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "api-gateway-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-024b00eb391a7d4fd",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "api-gateway-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "api-gateway"
                  + port     = 8011
                }
            }
        }
    }

  # module.api-gateway_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-gateway-service:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "api-gateway_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "api-gateway"
                        }
                    }
                  + memory           = 512
                  + name             = "api-gateway-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8011
                          + hostPort      = 8011
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "api-gateway-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.auth-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "auth-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "auth-service-foo-dev"
          + container_port   = 8012
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/auth-service-foo-dev-tg/71b26e8554732ce6"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-01ce2311e796cec5e",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "auth-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "auth-service"
                  + port     = 8012
                }
            }
        }
    }

  # module.auth-service_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-auth-service:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "auth-service_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "auth-service"
                        }
                    }
                  + memory           = 512
                  + name             = "auth-service-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8012
                          + hostPort      = 8012
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "auth-service-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.cart-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "cart-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "cart-service-foo-dev"
          + container_port   = 8013
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/cart-service-foo-dev-tg/ad95c178d00dd53b"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0668ee3c88f5d6f23",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "cart-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "cart-service"
                  + port     = 8013
                }
            }
        }
    }

  # module.cart-service_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-cart-service:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "cart-service_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "cart-service"
                        }
                    }
                  + memory           = 512
                  + name             = "cart-service-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8013
                          + hostPort      = 8013
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "cart-service-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.discovery-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "discovery-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0e53b1c55a3924697",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "discovery-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "discovery-service"
                  + port     = 8010
                }
            }
        }
    }

  # module.discovery-service_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-service-discovery:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "discovery-service_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "discovery-service"
                        }
                    }
                  + memory           = 512
                  + name             = "discovery-service-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8010
                          + hostPort      = 8010
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "discovery-service-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.orchestration-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "orchestration-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "orchestration-service-foo-dev"
          + container_port   = 8014
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/orchestration-service-foo-dev-tg/60368a367b7cbfc1"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-08707c1bb5e2ee50f",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "orchestration-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "orchestration-service"
                  + port     = 8014
                }
            }
        }
    }

  # module.orchestration-service_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-orchestration-service:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "orchestration-service_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "orchestration-service"
                        }
                    }
                  + memory           = 512
                  + name             = "orchestration-service-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8014
                          + hostPort      = 8014
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "orchestration-service-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.order-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "order-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "order-service-foo-dev"
          + container_port   = 8015
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/order-service-foo-dev-tg/02ee5b203cbc8c2a"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-00af7a3f89f631d99",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "order-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "order-service"
                  + port     = 8015
                }
            }
        }
    }

  # module.order-service_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-order-service:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "order-service_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "order-service"
                        }
                    }
                  + memory           = 512
                  + name             = "order-service-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8015
                          + hostPort      = 8015
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "order-service-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.private_nat_gw_route.aws_route.route will be updated in-place
~ resource "aws_route" "route" {
      + gateway_id             = "nat-0f243d298f6914cf5"
        id                     = "r-rtb-01630b97a65950b3f1080289494"
      - nat_gateway_id         = "nat-0f243d298f6914cf5" -> null
        # (4 unchanged attributes hidden)
    }

  # module.product-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "product-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "product-service-foo-dev"
          + container_port   = 8016
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/product-service-foo-dev-tg/b203db460232ccf6"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-01e050d72deefb012",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "product-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "product-service"
                  + port     = 8016
                }
            }
        }
    }

  # module.product-service_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-product-service:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "product-service_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "product-service"
                        }
                    }
                  + memory           = 512
                  + name             = "product-service-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8016
                          + hostPort      = 8016
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "product-service-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.user-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "user-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "user-service-foo-dev"
          + container_port   = 8017
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/user-service-foo-dev-tg/415cb0528cb871f1"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0dce8846f7e2a2a63",
            ]
          + subnets          = [
              + "subnet-02d4e3071a456f57c",
              + "subnet-050eb2f485eacd469",
              + "subnet-061f6d4b5d8c56802",
              + "subnet-07c74b0970bcaa1ea",
              + "subnet-09d1c2cf62fae9f7f",
              + "subnet-0da3d836ad5f5f7af",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "user-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "user-service"
                  + port     = 8017
                }
            }
        }
    }

  # module.user-service_task_definition.aws_ecs_task_definition.task will be created
+ resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 10
                  + environment      = [
                      + {
                          + name  = "RDS_ENDPOINT"
                          + value = "mysql-db.cqn93tumhlqo.us-east-1.rds.amazonaws.com:3306"
                        },
                    ]
                  + essential        = true
                  + image            = "appcd2023/is-user-service:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "user-service_foo_dev"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "user-service"
                        }
                    }
                  + memory           = 512
                  + name             = "user-service-foo-dev"
                  + portMappings     = [
                      + {
                          + containerPort = 8017
                          + hostPort      = 8017
                          + name          = "local"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role"
      + family                   = "user-service-foo-dev-ecs-task-def"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

Plan: 16 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d appCD`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-dev.dev.appcd.io/lock?id=cafi-dev%252FE-Commerce-Microservice-Platform%252FappCD%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d appCD`
</details>
Plan: 16 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`